FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX600_RX63N-RDK_Renesas/RTOSDemo/Renesas-Files/mcu/rx63n/iodefine.h
#define	__IR( x )		ICU.IR[ IR ## x ].BIT.IR
#define	 _IR( x )		__IR( x )
#define	  IR( x , y )	_IR( _ ## x ## _ ## y )
#define	__DTCE( x )		ICU.DTCER[ DTCE ## x ].BIT.DTCE
#define	 _DTCE( x )		__DTCE( x )
#define	  DTCE( x , y )	_DTCE( _ ## x ## _ ## y )
#define	__IEN( x )		ICU.IER[ IER ## x ].BIT.IEN ## x
#define	 _IEN( x )		__IEN( x )
#define	  IEN( x , y )	_IEN( _ ## x ## _ ## y )
#define	__IPR( x )		ICU.IPR[ IPR ## x ].BIT.IPR
#define	 _IPR( x )		__IPR( x )
#define	  IPR( x , y )	_IPR( _ ## x ## _ ## y )
#define	__VECT( x )		VECT ## x
#define	 _VECT( x )		__VECT( x )
#define	  VECT( x , y )	_VECT( _ ## x ## _ ## y )
#define	__MSTP( x )		MSTP ## x
#define	 _MSTP( x )		__MSTP( x )
#define	  MSTP( x )		_MSTP( _ ## x )

#define	__IS( x )		ICU.GRP[ GRP ## x ].BIT.IS ## x
#define	 _IS( x )		__IS( x )
#define	  IS( x , y )	_IS( _ ## x ## _ ## y )
#define	__EN( x )		ICU.GEN[ GEN ## x ].BIT.EN ## x
#define	 _EN( x )		__EN( x )
#define	  EN( x , y )	_EN( _ ## x ## _ ## y )
#define	__CLR( x )		ICU.GCR[ GCR ## x ].BIT.CLR ## x
#define	 _CLR( x )		__CLR( x )
#define	  CLR( x , y )	_CLR( _ ## x ## _ ## y )
#define	__CN( x )		ICU.SEL.BIT.CN ## x
#define	 _CN( x )		__CN( x )
#define	  CN( x , y )	_CN( _ ## x ## _ ## y )

#define	AD		(*(volatile struct st_ad      __evenaccess *)0x89800)
#define	BSC		(*(volatile struct st_bsc     __evenaccess *)0x81300)
#define	CAN0	(*(volatile struct st_can     __evenaccess *)0x90200)
#define	CAN1	(*(volatile struct st_can     __evenaccess *)0x91200)
#define	CAN2	(*(volatile struct st_can     __evenaccess *)0x92200)
#define	CMT		(*(volatile struct st_cmt     __evenaccess *)0x88000)
#define	CMT0	(*(volatile struct st_cmt0    __evenaccess *)0x88002)
#define	CMT1	(*(volatile struct st_cmt0    __evenaccess *)0x88008)
#define	CMT2	(*(volatile struct st_cmt0    __evenaccess *)0x88012)
#define	CMT3	(*(volatile struct st_cmt0    __evenaccess *)0x88018)
#define	CRC		(*(volatile struct st_crc     __evenaccess *)0x88280)
#define	DA		(*(volatile struct st_da      __evenaccess *)0x880C0)
#define	DMAC	(*(volatile struct st_dmac    __evenaccess *)0x82200)
#define	DMAC0	(*(volatile struct st_dmac0   __evenaccess *)0x82000)
#define	DMAC1	(*(volatile struct st_dmac1   __evenaccess *)0x82040)
#define	DMAC2	(*(volatile struct st_dmac1   __evenaccess *)0x82080)
#define	DMAC3	(*(volatile struct st_dmac1   __evenaccess *)0x820C0)
#define	DTC		(*(volatile struct st_dtc     __evenaccess *)0x82400)
#define	EDMAC	(*(volatile struct st_edmac   __evenaccess *)0xC0000)
#define	ETHERC	(*(volatile struct st_etherc  __evenaccess *)0xC0100)
#define	EXDMAC	(*(volatile struct st_exdmac  __evenaccess *)0x82A00)
#define	EXDMAC0	(*(volatile struct st_exdmac0 __evenaccess *)0x82800)
#define	EXDMAC1	(*(volatile struct st_exdmac1 __evenaccess *)0x82840)
#define	FLASH	(*(volatile struct st_flash   __evenaccess *)0x8C296)
#define	ICU		(*(volatile struct st_icu     __evenaccess *)0x87000)
#define	IEB		(*(volatile struct st_ieb     __evenaccess *)0x8A800)
#define	IWDT	(*(volatile struct st_iwdt    __evenaccess *)0x88030)
#define	MPC		(*(volatile struct st_mpc     __evenaccess *)0x8C100)
#define	MTU		(*(volatile struct st_mtu     __evenaccess *)0x8860A)
#define	MTU0	(*(volatile struct st_mtu0    __evenaccess *)0x88690)
#define	MTU1	(*(volatile struct st_mtu1    __evenaccess *)0x88690)
#define	MTU2	(*(volatile struct st_mtu2    __evenaccess *)0x88692)
#define	MTU3	(*(volatile struct st_mtu3    __evenaccess *)0x88600)
#define	MTU4	(*(volatile struct st_mtu4    __evenaccess *)0x88600)
#define	MTU5	(*(volatile struct st_mtu5    __evenaccess *)0x88694)
#define	POE		(*(volatile struct st_poe     __evenaccess *)0x88900)
#define	PORT0	(*(volatile struct st_port0   __evenaccess *)0x8C000)
#define	PORT1	(*(volatile struct st_port1   __evenaccess *)0x8C001)
#define	PORT2	(*(volatile struct st_port2   __evenaccess *)0x8C002)
#define	PORT3	(*(volatile struct st_port3   __evenaccess *)0x8C003)
#define	PORT4	(*(volatile struct st_port4   __evenaccess *)0x8C004)
#define	PORT5	(*(volatile struct st_port5   __evenaccess *)0x8C005)
#define	PORT6	(*(volatile struct st_port6   __evenaccess *)0x8C006)
#define	PORT7	(*(volatile struct st_port7   __evenaccess *)0x8C007)
#define	PORT8	(*(volatile struct st_port8   __evenaccess *)0x8C008)
#define	PORT9	(*(volatile struct st_port9   __evenaccess *)0x8C009)
#define	PORTA	(*(volatile struct st_porta   __evenaccess *)0x8C00A)
#define	PORTB	(*(volatile struct st_portb   __evenaccess *)0x8C00B)
#define	PORTC	(*(volatile struct st_portc   __evenaccess *)0x8C00C)
#define	PORTD	(*(volatile struct st_portd   __evenaccess *)0x8C00D)
#define	PORTE	(*(volatile struct st_porte   __evenaccess *)0x8C00E)
#define	PORTF	(*(volatile struct st_portf   __evenaccess *)0x8C00F)
#define	PORTG	(*(volatile struct st_portg   __evenaccess *)0x8C010)
#define	PORTH	(*(volatile struct st_porth   __evenaccess *)0x8C0D1)
#define	PORTJ	(*(volatile struct st_portj   __evenaccess *)0x8C012)
#define	PPG0	(*(volatile struct st_ppg0    __evenaccess *)0x881E6)
#define	PPG1	(*(volatile struct st_ppg1    __evenaccess *)0x881F0)
#define	RIIC0	(*(volatile struct st_riic0   __evenaccess *)0x88300)
#define	RIIC1	(*(volatile struct st_riic1   __evenaccess *)0x88320)
#define	RIIC2	(*(volatile struct st_riic1   __evenaccess *)0x88340)
#define	RIIC3	(*(volatile struct st_riic1   __evenaccess *)0x88360)
#define	RSPI0	(*(volatile struct st_rspi    __evenaccess *)0x88380)
#define	RSPI1	(*(volatile struct st_rspi    __evenaccess *)0x883A0)
#define	RSPI2	(*(volatile struct st_rspi    __evenaccess *)0x883C0)
#define	RTC		(*(volatile struct st_rtc     __evenaccess *)0x8C400)
#define	S12AD	(*(volatile struct st_s12ad   __evenaccess *)0x89000)
#define	SCI0	(*(volatile struct st_sci0    __evenaccess *)0x8A000)
#define	SCI1	(*(volatile struct st_sci0    __evenaccess *)0x8A020)
#define	SCI2	(*(volatile struct st_sci0    __evenaccess *)0x8A040)
#define	SCI3	(*(volatile struct st_sci0    __evenaccess *)0x8A060)
#define	SCI4	(*(volatile struct st_sci0    __evenaccess *)0x8A080)
#define	SCI5	(*(volatile struct st_sci0    __evenaccess *)0x8A0A0)
#define	SCI6	(*(volatile struct st_sci0    __evenaccess *)0x8A0C0)
#define	SCI7	(*(volatile struct st_sci7    __evenaccess *)0x8A0E0)
#define	SCI8	(*(volatile struct st_sci0    __evenaccess *)0x8A100)
#define	SCI9	(*(volatile struct st_sci0    __evenaccess *)0x8A120)
#define	SCI10	(*(volatile struct st_sci0    __evenaccess *)0x8A140)
#define	SCI11	(*(volatile struct st_sci0    __evenaccess *)0x8A160)
#define	SCI12	(*(volatile struct st_sci12   __evenaccess *)0x8B300)
#define	SMCI0	(*(volatile struct st_smci0   __evenaccess *)0x8A000)
#define	SMCI1	(*(volatile struct st_smci0   __evenaccess *)0x8A020)
#define	SMCI2	(*(volatile struct st_smci0   __evenaccess *)0x8A040)
#define	SMCI3	(*(volatile struct st_smci0   __evenaccess *)0x8A060)
#define	SMCI4	(*(volatile struct st_smci0   __evenaccess *)0x8A080)
#define	SMCI5	(*(volatile struct st_smci0   __evenaccess *)0x8A0A0)
#define	SMCI6	(*(volatile struct st_smci0   __evenaccess *)0x8A0C0)
#define	SMCI7	(*(volatile struct st_smci7   __evenaccess *)0x8A0E0)
#define	SMCI8	(*(volatile struct st_smci0   __evenaccess *)0x8A100)
#define	SMCI9	(*(volatile struct st_smci0   __evenaccess *)0x8A120)
#define	SMCI10	(*(volatile struct st_smci0   __evenaccess *)0x8A140)
#define	SMCI11	(*(volatile struct st_smci0   __evenaccess *)0x8A160)
#define	SMCI12	(*(volatile struct st_smci0   __evenaccess *)0x8B300)
#define	SYSTEM	(*(volatile struct st_system  __evenaccess *)0x80000)
#define	TEMPS	(*(volatile struct st_temps   __evenaccess *)0x8C500)
#define	TMR0	(*(volatile struct st_tmr0    __evenaccess *)0x88200)
#define	TMR1	(*(volatile struct st_tmr1    __evenaccess *)0x88201)
#define	TMR2	(*(volatile struct st_tmr0    __evenaccess *)0x88210)
#define	TMR3	(*(volatile struct st_tmr1    __evenaccess *)0x88211)
#define	TMR01	(*(volatile struct st_tmr01   __evenaccess *)0x88204)
#define	TMR23	(*(volatile struct st_tmr01   __evenaccess *)0x88214)
#define	TPU0	(*(volatile struct st_tpu0    __evenaccess *)0x88108)
#define	TPU1	(*(volatile struct st_tpu1    __evenaccess *)0x88108)
#define	TPU2	(*(volatile struct st_tpu2    __evenaccess *)0x8810A)
#define	TPU3	(*(volatile struct st_tpu3    __evenaccess *)0x8810A)
#define	TPU4	(*(volatile struct st_tpu4    __evenaccess *)0x8810C)
#define	TPU5	(*(volatile struct st_tpu5    __evenaccess *)0x8810C)
#define	TPU6	(*(volatile struct st_tpu0    __evenaccess *)0x88178)
#define	TPU7	(*(volatile struct st_tpu1    __evenaccess *)0x88178)
#define	TPU8	(*(volatile struct st_tpu2    __evenaccess *)0x8817A)
#define	TPU9	(*(volatile struct st_tpu3    __evenaccess *)0x8817A)
#define	TPU10	(*(volatile struct st_tpu4    __evenaccess *)0x8817C)
#define	TPU11	(*(volatile struct st_tpu5    __evenaccess *)0x8817C)
#define	TPUA	(*(volatile struct st_tpua    __evenaccess *)0x88100)
#define	TPUB	(*(volatile struct st_tpub    __evenaccess *)0x88170)
#define	USB		(*(volatile struct st_usb     __evenaccess *)0xA0400)
#define	USB0	(*(volatile struct st_usb0    __evenaccess *)0xA0000)
#define	USB1	(*(volatile struct st_usb1    __evenaccess *)0xA0200)
#define	WDT		(*(volatile struct st_wdt     __evenaccess *)0x88020)
#pragma bit_order
#pragma packoption
#endif
